In [20]:
import pandas as pd  #powerful version of microsoft excel
import numpy as np

In [21]:
#Dataframe is table and series is column

In [22]:
my_list1 = [45,46,47,48,49]

In [23]:
my_list2 = ['A','B','C','D','E']

In [24]:
arr = np.array([2001,2002,2003,2004,2005])

In [25]:
d = {'p':31,'q':32,'r':33,'s':34,'t':35}

In [26]:
pd.Series(my_list1)

0    45
1    46
2    47
3    48
4    49
dtype: int64

In [27]:
pd.Series(data = my_list1, index = my_list2)

A    45
B    46
C    47
D    48
E    49
dtype: int64

In [28]:
pd.Series(data = my_list2, index = my_list1)

45    A
46    B
47    C
48    D
49    E
dtype: object

In [29]:
pd.Series(my_list2, my_list1) #data,index

45    A
46    B
47    C
48    D
49    E
dtype: object

In [30]:
s1 = pd.Series(my_list2, my_list1)

In [31]:
s1

45    A
46    B
47    C
48    D
49    E
dtype: object

In [32]:
type(s1)

pandas.core.series.Series

In [33]:
pd.Series(arr,my_list2)

A    2001
B    2002
C    2003
D    2004
E    2005
dtype: int32

In [34]:
pd.Series(d)

p    31
q    32
r    33
s    34
t    35
dtype: int64

In [35]:
pd.Series(d,my_list1) #its because of d is dictionary

45   NaN
46   NaN
47   NaN
48   NaN
49   NaN
dtype: float64

In [36]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [44]:
ser1 = pd.Series([11,20,30,15],index = ['Mumbai','Pune','Banglore','Delhi'])

In [45]:
ser2 = pd.Series([11,20,30,15],index = ['Mumbai','Pune','Chennai','Delhi'])

In [46]:
ser1

Mumbai      11
Pune        20
Banglore    30
Delhi       15
dtype: int64

In [47]:
ser2

Mumbai     11
Pune       20
Chennai    30
Delhi      15
dtype: int64

In [48]:
ser1 + ser2

Banglore     NaN
Chennai      NaN
Delhi       30.0
Mumbai      22.0
Pune        40.0
dtype: float64

## DataFrames - Collection of series

In [49]:
np.random.randn(5,4)

array([[ 0.93783105,  1.31020635, -1.82521927, -0.22172208],
       [ 0.9726592 ,  0.26470629, -1.03620095,  0.84283276],
       [ 0.90849079,  1.22205141, -0.33124441, -0.05126751],
       [ 0.5878589 ,  0.92566312, -0.09500545, -0.32667245],
       [ 0.83003278,  0.99647267, -0.97851179, -0.07494167]])

In [52]:
my_df = pd.DataFrame(np.random.randn(5,4),index = ['A','B','C','D','E'],columns = ['W','X','Y','Z'])

In [53]:
my_df

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
D  0.486490 -0.128899  0.364143  1.168767
E -0.505238 -0.113475 -1.470825 -1.222666

In [54]:
type(my_df)

pandas.core.frame.DataFrame

In [55]:
my_df['W']

A    0.263070
B    1.088608
C    1.059447
D    0.486490
E   -0.505238
Name: W, dtype: float64

In [56]:
type(my_df['W'])

pandas.core.series.Series

In [58]:
my_df[['X','Y']]

          X         Y
A -2.321644 -0.880686
B  0.706817 -0.581396
C -0.314082 -1.360513
D -0.128899  0.364143
E -0.113475 -1.470825

In [59]:
type(my_df[['X','Y']])

pandas.core.frame.DataFrame

In [60]:
my_df.Y #another method to write

A   -0.880686
B   -0.581396
C   -1.360513
D    0.364143
E   -1.470825
Name: Y, dtype: float64

In [61]:
my_df['values'] = my_df['W'] + my_df['Z']

In [62]:
my_df

          W         X         Y         Z    values
A  0.263070 -2.321644 -0.880686 -1.657676 -1.394606
B  1.088608  0.706817 -0.581396  1.057740  2.146348
C  1.059447 -0.314082 -1.360513  0.248993  1.308440
D  0.486490 -0.128899  0.364143  1.168767  1.655257
E -0.505238 -0.113475 -1.470825 -1.222666 -1.727905

In [63]:
my_df.columns

Index(['W', 'X', 'Y', 'Z', 'values'], dtype='object')

In [64]:
my_df.drop('values',axis = 1) #by default axis  = 0 and axis = 0 is rows but values is in column

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
D  0.486490 -0.128899  0.364143  1.168767
E -0.505238 -0.113475 -1.470825 -1.222666

In [65]:
my_df

          W         X         Y         Z    values
A  0.263070 -2.321644 -0.880686 -1.657676 -1.394606
B  1.088608  0.706817 -0.581396  1.057740  2.146348
C  1.059447 -0.314082 -1.360513  0.248993  1.308440
D  0.486490 -0.128899  0.364143  1.168767  1.655257
E -0.505238 -0.113475 -1.470825 -1.222666 -1.727905

In [66]:
my_df.drop('values',axis = 1,inplace = True) #inplace = true make it permanant.

In [67]:
my_df

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
D  0.486490 -0.128899  0.364143  1.168767
E -0.505238 -0.113475 -1.470825 -1.222666

In [69]:
my_df.drop('D') #by default axis is zero, it will not drop permanantly because we  didnot use inplace

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
E -0.505238 -0.113475 -1.470825 -1.222666

In [70]:
my_df

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
D  0.486490 -0.128899  0.364143  1.168767
E -0.505238 -0.113475 -1.470825 -1.222666

In [72]:
my_df.loc['B'] #index row wise by using loc

W    1.088608
X    0.706817
Y   -0.581396
Z    1.057740
Name: B, dtype: float64

In [73]:
my_df

          W         X         Y         Z
A  0.263070 -2.321644 -0.880686 -1.657676
B  1.088608  0.706817 -0.581396  1.057740
C  1.059447 -0.314082 -1.360513  0.248993
D  0.486490 -0.128899  0.364143  1.168767
E -0.505238 -0.113475 -1.470825 -1.222666

In [74]:
my_df.loc['D']

W    0.486490
X   -0.128899
Y    0.364143
Z    1.168767
Name: D, dtype: float64

In [77]:
my_df.iloc[0] #instead of loc we need to write iloc for index value

W    0.263070
X   -2.321644
Y   -0.880686
Z   -1.657676
Name: A, dtype: float64

In [78]:
my_df.iloc[2]

W    1.059447
X   -0.314082
Y   -1.360513
Z    0.248993
Name: C, dtype: float64

In [79]:
my_df.loc['D','Y']

0.3641431358300334

In [82]:
my_df.loc[['A','E'],['W','Z']]

          W         Z
A  0.263070 -1.657676
E -0.505238 -1.222666

In [2]:
import pandas as pd  #powerful version of microsoft excel
import numpy as np

In [3]:
my_df = pd.DataFrame(np.random.randn(5,4),index = ['A','B','C','D','E'],columns = ['W','X','Y','Z'])

In [4]:
my_df

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155
D -0.483834 -0.895771  1.521297 -0.000182
E -1.160575  0.648228  1.221891  0.699657

In [5]:
my_df>0

       W      X     Y      Z
A   True  False  True  False
B   True   True  True  False
C   True  False  True   True
D  False  False  True  False
E  False   True  True   True

In [6]:
my_df[my_df>0]

          W         X         Y         Z
A  1.343355       NaN  2.245648       NaN
B  0.123231  0.706604  0.608925       NaN
C  1.154473       NaN  0.284410  1.075155
D       NaN       NaN  1.521297       NaN
E       NaN  0.648228  1.221891  0.699657

In [7]:
my_df['W']

A    1.343355
B    0.123231
C    1.154473
D   -0.483834
E   -1.160575
Name: W, dtype: float64

In [8]:
my_df['W']>0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [9]:
my_df[my_df['W']>0]

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155

In [10]:
my_df[my_df['W']>0]['Z']

A   -0.888973
B   -0.117427
C    1.075155
Name: Z, dtype: float64

In [11]:
my_df[my_df['W']>0]['W']

A    1.343355
B    0.123231
C    1.154473
Name: W, dtype: float64

In [12]:
my_df[my_df['W']>0][['X','Z']]

          X         Z
A -0.485597 -0.888973
B  0.706604 -0.117427
C -0.342070  1.075155

In [13]:
(my_df['W']>0) & (my_df['Y'] >0)

A     True
B     True
C     True
D    False
E    False
dtype: bool

In [14]:
my_df

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155
D -0.483834 -0.895771  1.521297 -0.000182
E -1.160575  0.648228  1.221891  0.699657

In [15]:
my_df[(my_df['W']>0) & (my_df['Y'] >0)]

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155

In [16]:
my_df[(my_df['W']>0) | (my_df['Y'] >0)]

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155
D -0.483834 -0.895771  1.521297 -0.000182
E -1.160575  0.648228  1.221891  0.699657

In [17]:
my_df

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155
D -0.483834 -0.895771  1.521297 -0.000182
E -1.160575  0.648228  1.221891  0.699657

In [18]:
my_df.reset_index()#show default index

  index         W         X         Y         Z
0     A  1.343355 -0.485597  2.245648 -0.888973
1     B  0.123231  0.706604  0.608925 -0.117427
2     C  1.154473 -0.342070  0.284410  1.075155
3     D -0.483834 -0.895771  1.521297 -0.000182
4     E -1.160575  0.648228  1.221891  0.699657

In [19]:
my_df

          W         X         Y         Z
A  1.343355 -0.485597  2.245648 -0.888973
B  0.123231  0.706604  0.608925 -0.117427
C  1.154473 -0.342070  0.284410  1.075155
D -0.483834 -0.895771  1.521297 -0.000182
E -1.160575  0.648228  1.221891  0.699657

In [20]:
data = ['Pune','Mumbai','Banglore','Chennai','Delhi']

In [21]:
my_df['City'] = data

In [22]:
my_df

          W         X         Y         Z      City
A  1.343355 -0.485597  2.245648 -0.888973      Pune
B  0.123231  0.706604  0.608925 -0.117427    Mumbai
C  1.154473 -0.342070  0.284410  1.075155  Banglore
D -0.483834 -0.895771  1.521297 -0.000182   Chennai
E -1.160575  0.648228  1.221891  0.699657     Delhi

In [23]:
my_df.set_index('City')

                 W         X         Y         Z
City
Pune      1.343355 -0.485597  2.245648 -0.888973
Mumbai    0.123231  0.706604  0.608925 -0.117427
Banglore  1.154473 -0.342070  0.284410  1.075155
Chennai  -0.483834 -0.895771  1.521297 -0.000182
Delhi    -1.160575  0.648228  1.221891  0.699657

In [24]:
my_df

          W         X         Y         Z      City
A  1.343355 -0.485597  2.245648 -0.888973      Pune
B  0.123231  0.706604  0.608925 -0.117427    Mumbai
C  1.154473 -0.342070  0.284410  1.075155  Banglore
D -0.483834 -0.895771  1.521297 -0.000182   Chennai
E -1.160575  0.648228  1.221891  0.699657     Delhi

In [25]:
my_df.set_index('City', inplace = True)

In [26]:
my_df

                 W         X         Y         Z
City
Pune      1.343355 -0.485597  2.245648 -0.888973
Mumbai    0.123231  0.706604  0.608925 -0.117427
Banglore  1.154473 -0.342070  0.284410  1.075155
Chennai  -0.483834 -0.895771  1.521297 -0.000182
Delhi    -1.160575  0.648228  1.221891  0.699657

## Multi Index and Index Hirarchy

In [27]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [28]:
zip(outside,inside)

In [29]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [30]:
h_index = list(zip(outside,inside))

In [33]:
pd.MultiIndex.from_tuples(h_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [34]:
hier_index = pd.MultiIndex.from_tuples(h_index)

In [35]:
np.random.randn(6,2)

array([[ 0.68874643,  0.22700637],
       [ 0.27420639,  0.72652751],
       [ 1.38541391, -1.7470494 ],
       [ 0.12475195, -0.28185185],
       [ 0.32366921,  0.74925855],
       [ 1.28402747,  0.77231602]])

In [36]:
pd.DataFrame(data = np.random.randn(6,2), index = hier_index, columns = ['A','B'])

             A         B
G1 1 -2.517517 -0.805130
   2  0.064223  1.373040
   3 -0.823221 -0.091297
G2 1  2.436887 -0.002342
   2  0.799902  2.223049
   3 -0.494036 -0.654246

In [37]:
df = pd.DataFrame(data = np.random.randn(6,2), index = hier_index, columns = ['A','B'])

In [38]:
df

             A         B
G1 1 -0.248252  2.306446
   2 -1.812476 -0.477267
   3 -0.108207 -0.564703
G2 1 -2.018205 -0.138284
   2  0.327804  0.252584
   3  0.574587 -0.996227

In [39]:
df.loc['G1']

          A         B
1 -0.248252  2.306446
2 -1.812476 -0.477267
3 -0.108207 -0.564703

In [40]:
df.loc['G2']

          A         B
1 -2.018205 -0.138284
2  0.327804  0.252584
3  0.574587 -0.996227

In [41]:
df.loc['G1'].loc[1]

A   -0.248252
B    2.306446
Name: 1, dtype: float64

In [42]:
df.loc['G2'].loc[2]

A    0.327804
B    0.252584
Name: 2, dtype: float64

In [43]:
df.index.names

FrozenList([None, None])

In [44]:
df.index.names = ['Group','Num']

In [45]:
df

                  A         B
Group Num
G1    1   -0.248252  2.306446
      2   -1.812476 -0.477267
      3   -0.108207 -0.564703
G2    1   -2.018205 -0.138284
      2    0.327804  0.252584
      3    0.574587 -0.996227

In [46]:
df.xs('G2')

            A         B
Num
1   -2.018205 -0.138284
2    0.327804  0.252584
3    0.574587 -0.996227

In [47]:
df.xs(('G2',3))

A    0.574587
B   -0.996227
Name: (G2, 3), dtype: float64

In [48]:
df.xs(2,level='Num')

              A         B
Group
G1    -1.812476 -0.477267
G2     0.327804  0.252584

## Missing data

In [49]:
## Any arithmetic operarion with null always results null
## 10 + null = null

In [50]:
np.nan

nan

In [53]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[4,7,8]})

In [54]:
df

     A    B  C
0  1.0  5.0  4
1  2.0  NaN  7
2  NaN  NaN  8

In [55]:
df.dropna() #drop rows which contain NaN values

     A    B  C
0  1.0  5.0  4

In [57]:
df.dropna(axis = 1)

   C
0  4
1  7
2  8

In [58]:
df.dropna(thresh=3) #atleast 3 values should be there in one row

     A    B  C
0  1.0  5.0  4

In [59]:
df.dropna(thresh=2) #atleast 2 values should be there in one row

     A    B  C
0  1.0  5.0  4
1  2.0  NaN  7

In [60]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  4
1  2.0  NaN  7
2  NaN  NaN  8

In [61]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [63]:
df.fillna(value='Pune')

      A     B  C
0   1.0   5.0  4
1   2.0  Pune  7
2  Pune  Pune  8

In [66]:
df['A'].mean()

1.5

In [67]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [1]:
import pandas as pd

## Group By

In [2]:
data = {'company':['google','google','ms','ms','fb','fb'],
       'employee':['rahul','sachin','adam','saurav','gautam','rohit'],
       'sales':[300,120,320,340,130,321]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

  company employee  sales
0  google    rahul    300
1  google   sachin    120
2      ms     adam    320
3      ms   saurav    340
4      fb   gautam    130
5      fb    rohit    321

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.groupby('company')

In [8]:
df.groupby('company').sum()

         sales
company
fb         451
google     420
ms         660

In [11]:
by_comp = df.groupby('company')

In [12]:
by_comp.sum()

         sales
company
fb         451
google     420
ms         660

In [13]:
by_comp.mean()

         sales
company
fb       225.5
google   210.0
ms       330.0

In [14]:
by_comp.min()

        employee  sales
company
fb        gautam    130
google     rahul    120
ms          adam    320

In [15]:
by_comp.max()

        employee  sales
company
fb         rohit    321
google    sachin    300
ms        saurav    340

In [16]:
by_comp.count()

         employee  sales
company
fb              2      2
google          2      2
ms              2      2

In [17]:
by_comp.std()

              sales
company
fb       135.057395
google   127.279221
ms        14.142136

In [18]:
by_comp.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  225.5  135.057395  130.0  177.75  225.5  273.25  321.0
google    2.0  210.0  127.279221  120.0  165.00  210.0  255.00  300.0
ms        2.0  330.0   14.142136  320.0  325.00  330.0  335.00  340.0

In [19]:
by_comp.describe().loc['google']

sales  count      2.000000
       mean     210.000000
       std      127.279221
       min      120.000000
       25%      165.000000
       50%      210.000000
       75%      255.000000
       max      300.000000
Name: google, dtype: float64

In [20]:
by_comp.describe().transpose()

company              fb      google          ms
sales count    2.000000    2.000000    2.000000
      mean   225.500000  210.000000  330.000000
      std    135.057395  127.279221   14.142136
      min    130.000000  120.000000  320.000000
      25%    177.750000  165.000000  325.000000
      50%    225.500000  210.000000  330.000000
      75%    273.250000  255.000000  335.000000
      max    321.000000  300.000000  340.000000

## Operations

In [25]:
df = pd.DataFrame({'marks':[10,20,30,40],'roll_no':[44,55,66,44],'name':['rahul','rohit','saurav','yash']})

In [26]:
df

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df['roll_no']

0    44
1    55
2    66
3    44
Name: roll_no, dtype: int64

In [29]:
df['roll_no'].unique()

array([44, 55, 66], dtype=int64)

In [30]:
df['roll_no'].nunique()

3

In [32]:
df['roll_no']

0    44
1    55
2    66
3    44
Name: roll_no, dtype: int64

In [33]:
df['roll_no'].value_counts()

44    2
55    1
66    1
Name: roll_no, dtype: int64

In [34]:
df['marks']>20

0    False
1    False
2     True
3     True
Name: marks, dtype: bool

In [35]:
(df['marks']>20) & (df['roll_no']==44)

0    False
1    False
2    False
3     True
dtype: bool

In [37]:
df[(df['marks']>20) & (df['roll_no']==44)]

   marks  roll_no  name
3     40       44  yash

In [38]:
def find_cube(n):
    return n**3

In [39]:
df['marks'].apply(find_cube)

0     1000
1     8000
2    27000
3    64000
Name: marks, dtype: int64

In [40]:
df['name']

0     rahul
1     rohit
2    saurav
3      yash
Name: name, dtype: object

In [41]:
df['name'].apply(len)

0    5
1    5
2    6
3    4
Name: name, dtype: int64

In [42]:
df['name'].apply(lambda x: x[1]=='a')

0     True
1    False
2     True
3     True
Name: name, dtype: bool

In [43]:
df[df['name'].apply(lambda x: x[1]=='a')]

   marks  roll_no    name
0     10       44   rahul
2     30       66  saurav
3     40       44    yash

In [44]:
df

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [45]:
df['roll_no'].sum()

209

In [46]:
df['percentage'] = df['marks']/(df['roll_no'].sum())*100

In [47]:
df

   marks  roll_no    name  percentage
0     10       44   rahul    4.784689
1     20       55   rohit    9.569378
2     30       66  saurav   14.354067
3     40       44    yash   19.138756

In [48]:
df

   marks  roll_no    name  percentage
0     10       44   rahul    4.784689
1     20       55   rohit    9.569378
2     30       66  saurav   14.354067
3     40       44    yash   19.138756

In [49]:
df.columns

Index(['marks', 'roll_no', 'name', 'percentage'], dtype='object')

In [50]:
del df['percentage']

In [51]:
df

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [53]:
df.drop('name',axis = 1) #drop cant delete permanantly

   marks  roll_no
0     10       44
1     20       55
2     30       66
3     40       44

In [54]:
df

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [55]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [56]:
df.sort_values(by='roll_no')

   marks  roll_no    name
0     10       44   rahul
3     40       44    yash
1     20       55   rohit
2     30       66  saurav

In [57]:
df.sort_values(by='roll_no', ascending=False)

   marks  roll_no    name
2     30       66  saurav
1     20       55   rohit
0     10       44   rahul
3     40       44    yash

In [58]:
df

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [59]:
df.isnull()

   marks  roll_no   name
0  False    False  False
1  False    False  False
2  False    False  False
3  False    False  False

In [60]:
df.dropna()

   marks  roll_no    name
0     10       44   rahul
1     20       55   rohit
2     30       66  saurav
3     40       44    yash

In [1]:
import pandas as pd

## data input and output

In [3]:
pwd

'C:\\Users\\Hp\\DataScienceCourse'

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
df = pd.read_excel('Excel_Sample.xlsx')

In [10]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [11]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df2 = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

In [16]:
df2

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
df.to_csv('friday')

In [18]:
df.to_csv('friday1', index = False)

In [20]:
df.to_excel('friday_excel.xlsx', sheet_name='my_data')

In [21]:
df4 = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [22]:
df4

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [23]:
type(df4)

list

In [24]:
df4[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [25]:
type(df4[0])

pandas.core.frame.DataFrame

In [26]:
df4[0]['CityCity']

0                 Almena
1      Fort Walton Beach
2          Barboursville
3                Ericson
4                 Newark
             ...
558             Hinsdale
559                Malta
560           Manchester
561           Metropolis
562             Honolulu
Name: CityCity, Length: 563, dtype: object

In [27]:
seq1 = pd.DataFrame({'x':[25,15,12,19],'y':[47,24,17,29]})

In [28]:
seq1

    x   y
0  25  47
1  15  24
2  12  17
3  19  29

In [29]:
seq2 = pd.DataFrame({'x':[25,15,12],'y':[47,24,17],'z':[38,12,45]})

In [30]:
seq2

    x   y   z
0  25  47  38
1  15  24  12
2  12  17  45

In [31]:
seq1.append(seq2)

C:\Users\Hp\AppData\Local\Temp\ipykernel_5640\1779827060.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  seq1.append(seq2)

    x   y     z
0  25  47   NaN
1  15  24   NaN
2  12  17   NaN
3  19  29   NaN
0  25  47  38.0
1  15  24  12.0
2  12  17  45.0

In [32]:
seq1.append(seq2,ignore_index=True)

C:\Users\Hp\AppData\Local\Temp\ipykernel_5640\1412636463.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  seq1.append(seq2,ignore_index=True)

    x   y     z
0  25  47   NaN
1  15  24   NaN
2  12  17   NaN
3  19  29   NaN
4  25  47  38.0
5  15  24  12.0
6  12  17  45.0

In [33]:
seq2.append(seq1,ignore_index=True)

C:\Users\Hp\AppData\Local\Temp\ipykernel_5640\1540068821.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  seq2.append(seq1,ignore_index=True)

    x   y     z
0  25  47  38.0
1  15  24  12.0
2  12  17  45.0
3  25  47   NaN
4  15  24   NaN
5  12  17   NaN
6  19  29   NaN

In [36]:
pd.concat([seq1,seq2])

    x   y     z
0  25  47   NaN
1  15  24   NaN
2  12  17   NaN
3  19  29   NaN
0  25  47  38.0
1  15  24  12.0
2  12  17  45.0

In [37]:
seq2

    x   y   z
0  25  47  38
1  15  24  12
2  12  17  45

In [38]:
seq2.agg(['sum'])

      x   y   z
sum  52  88  95

In [39]:
seq2.agg(['sum','min'])

      x   y   z
sum  52  88  95
min  12  17  12

In [40]:
seq2.agg(['sum','min','max'])

      x   y   z
sum  52  88  95
min  12  17  12
max  25  47  45

In [41]:
seq2.aggregate(['sum'])

      x   y   z
sum  52  88  95

In [42]:
seq2.agg(['sum','min','max','mean','std'])

              x          y          z
sum   52.000000  88.000000  95.000000
min   12.000000  17.000000  12.000000
max   25.000000  47.000000  45.000000
mean  17.333333  29.333333  31.666667
std    6.806859  15.695010  17.387735

In [43]:
seq2.agg(['sum','min','max','mean','std'],axis=1)

     sum   min   max       mean        std
0  110.0  25.0  47.0  36.666667  11.060440
1   51.0  12.0  24.0  17.000000   6.244998
2   74.0  12.0  45.0  24.666667  17.785762

In [44]:
data1 = pd.DataFrame()

In [45]:
data1

Empty DataFrame
Columns: []
Index: []

In [47]:
type(data1)

pandas.core.frame.DataFrame

In [48]:
data1['ID'] = [1001,1002,1003]

In [49]:
data1

     ID
0  1001
1  1002
2  1003

In [50]:
data1.assign(Name=['Rahul','Sachin','Rohit']) #other way to add new column

     ID    Name
0  1001   Rahul
1  1002  Sachin
2  1003   Rohit

In [51]:
data1

     ID
0  1001
1  1002
2  1003

In [52]:
data1.assign(Name=['Rahul','Sachin','Rohit'],inplace = True)

     ID    Name  inplace
0  1001   Rahul     True
1  1002  Sachin     True
2  1003   Rohit     True

In [53]:
data1

     ID
0  1001
1  1002
2  1003